// База данных кабинетов
// Координаты из Figma (только +)
// Пример для прямоугольной фигуры:
//{ 
//  name: название, 
//  desc: описание, 
//  type: "rect", 
//  x: координата х, 
//  y: координата y, 
//  w: ширина, 
//  h: высота
//}
// Пример для многоугольной фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "polygon", 
//  points: [х1, y1, x2, y2, x3, y3] // массив координат
//}
// Пример для круглой фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "circle", 
//  x: координата х центра, 
//  y: координата y центра, 
//  r: радиус
//}


const roomsData = {
    "1": [ // этаж
        {  
            name: "101 Кабинет", 
            desc: "Часы работы: с 9:00 до 17:00. Перерыв с 13:00 до 14:00.", 
            type: "rect", 
            x: 4595, 
            y: 3020, 
            w: 287, 
            h: 407 
        },
        {  
            name: "102 кабинет", 
            desc: "Выдача студенческих билетов и справок.", 
            type: "rect", 
            x: 4881, 
            y: 3019, 
            w: 477, 
            h: 408 
        },
        {  
            name: "108 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4980, 
            y: 3426, 
            w: 377, 
            h: 195
        },
        {  
            name: "102а кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 3868, 
            w: 477, 
            h: 637
        },
        {  
            name: "105 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 4504, 
            w: 477, 
            h: 546
        }
        ],
    "2": [],
    "3": []
};