// База данных кабинетов
// Координаты из Figma (только +)
// Пример для прямоугольной фигуры:
//{ 
//  name: название, 
//  desc: описание, 
//  type: "rect", 
//  x: координата х, 
//  y: координата y, 
//  w: ширина, 
//  h: высота
//}
// Пример для многоугольной фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "polygon", 
//  points: [х1, y1, x2, y2, x3, y3] // массив координат
//}
// Пример для круглой фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "circle", 
//  x: координата х центра, 
//  y: координата y центра, 
//  r: радиус
//}


const roomsData = {
    "1": [ // этаж
        {  
            name: "101 Кабинет", 
            desc: "Часы работы: с 9:00 до 17:00. Перерыв с 13:00 до 14:00.", 
            type: "rect", 
            x: 4595, 
            y: 3020, 
            w: 287, 
            h: 407 
        },
        {  
            name: "102 кабинет", 
            desc: "Выдача студенческих билетов и справок.", 
            type: "rect", 
            x: 4881, 
            y: 3019, 
            w: 477, 
            h: 408 
        },
        {  
            name: "108 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4980, 
            y: 3426, 
            w: 377, 
            h: 195
        },
        {  
            name: "102а кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 3868, 
            w: 477, 
            h: 637
        },
        {  
            name: "105 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 4504, 
            w: 477, 
            h: 546
        },
        {  
            name: "106 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 5206, 
            w: 477, 
            h: 491
        },
        { 
            name: "107 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4189, 
            y: 5405, 
            w: 693, 
            h: 519
        },
        {  
            name: "Мужской туалет", 
            desc: "", 
            type: "rect", 
            x: 2038, 
            y: 2014, 
            w: 509, 
            h: 400
        },
        { 
            name: "Женский туалет", 
            desc: "", 
            type: "rect", 
            x: 1745, 
            y: 2562, 
            w: 618, 
            h: 168
        },
        { 
            name: "Столовая", 
            desc: "", 
            type: "rect", 
            x: 0, 
            y: 4230, 
            w: 968, 
            h: 803
        },
        { 
            name: "Гардероб", 
            desc: "", 
            type: "rect", 
            x: 2032, 
            y: 4232, 
            w: 490, 
            h: 604
        },
        { 
            name: "Стол для пинг-понга", 
            desc: "", 
            type: "rect", 
            x: 1141, 
            y: 4334, 
            w: 153, 
            h: 301
        },
        { 
            name: "Кофе автомат", 
            desc: "", 
            type: "rect", 
            x: 1253, 
            y: 5019, 
            w: 80, 
            h: 95
        },
        { 
            name: "Вендинговый автомат", 
            desc: "", 
            type: "rect", 
            x: 1357, 
            y: 5034, 
            w: 80, 
            h: 80
        },
        { 
            name: "Кабинет СИС-админа", 
            desc: "", 
            type: "rect", 
            x: 840, 
            y: 1761, 
            w: 517, 
            h: 641
        },
        { 
            name: "Мед-кабинет", 
            desc: "", 
            type: "rect", 
            x: 1745, 
            y: 1323, 
            w: 669, 
            h: 585
        },
        { 
            name: "Инфо-табло", 
            desc: "", 
            type: "rect", 
            x: 1773, 
            y: 3606, 
            w: 130, 
            h: 61
        },
        { 
            name: "Вход/Выход", 
            desc: "", 
            type: "rect", 
            x: 1475, 
            y: 5033, 
            w: 433, 
            h: 93
        },
        { 
            name: "Туалет для ОВЗ", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 3728, 
            w: 141, 
            h: 141
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 840, 
            y: 2401, 
            w: 328, 
            h: 226
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 2031, 
            y: 3606, 
            w: 636, 
            h: 294
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 4190, 
            y: 3427, 
            w: 405, 
            h: 327
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 4190, 
            y: 5078, 
            w: 403, 
            h: 327
        },
        { 
            name: "104 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 5047, 
            w: 477, 
            h: 160
        },
        { 
            name: "Выход", 
            desc: "", 
            type: "rect", 
            x: 332, 
            y: 2626, 
            w: 45, 
            h: 154
        },
        { 
            name: "Охрана", 
            desc: "", 
            type: "rect", 
            x: 1906, 
            y: 5033, 
            w: 126, 
            h: 93
        },
        { 
            name: "Выход", 
            desc: "", 
            type: "rect", 
            x: 4145, 
            y: 3426, 
            w: 45, 
            h: 154
        },
        { 
            name: "Кабинет Социального Педагога", 
            desc: "", 
            type: "rect", 
            x: 5021, 
            y: 3620, 
            w: 337, 
            h: 250
        }
        ],
    "2": [{ 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 1, 
            y: 2054, 
            w: 224, 
            h: 300
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 0, 
            y: 500, 
            w: 403, 
            h: 327
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 4190, 
            y: 5078, 
            w: 403, 
            h: 327
        },
        { 
            name: "Лестница", 
            desc: "", 
            type: "rect", 
            x: 4190, 
            y: 5078, 
            w: 403, 
            h: 327
        },
        { 
            name: "104 кабинет", 
            desc: "", 
            type: "rect", 
            x: 4881, 
            y: 5047, 
            w: 477, 
            h: 160
        }
        ],
    "3": []
};