// config.js
// База данных кабинетов (координаты из Figma, Y строго положительный)

const roomsData = {
    "1": [
        { 
            id: "101", 
            name: "Приемная комиссия", 
            desc: "Часы работы: с 9:00 до 17:00. Перерыв с 13:00 до 14:00.", 
            type: "rect", 
            x: 2867, 
            y: 1776, 
            w: 287, 
            h: 407 
        },
        { 
            id: "102", 
            name: "Гардероб", 
            desc: "Выдача студенческих билетов и справок.", 
            type: "rect", 
            x: 3154, 
            y: 1776, 
            w: 350, 
            h: 407 
        }
    ],
    "2": [],
    "3": []
};