// База данных кабинетов
// Координаты из Figma (только +)
// Пример для прямоугольной фигуры:
//{ 
//  name: название, 
//  desc: описание, 
//  type: "rect", 
//  x: координата х, 
//  y: координата y, 
//  w: ширина, 
//  h: высота
//}
// Пример для многоугольной фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "polygon", 
//  points: [х1, y1, x2, y2, x3, y3] // массив координат
//}
// Пример для круглой фигуры:
//{  
//  name: название, 
//  desc: описание, 
//  type: "circle", 
//  x: координата х центра, 
//  y: координата y центра, 
//  r: радиус
//}


const roomsData = {
    "1": [ // этаж
        {  
            name: "101 Кабинет", 
            desc: "Очирова Н.В.", 
            type: "rect", 
            x: 4595, 
            y: 3020, 
            w: 287, 
            h: 407 
        },
        {  
            name: "102 кабинет", 
            desc: "Дмитриев Б.М.", 
            type: "rect", 
            x: 4881, 
            y: 3019, 
            w: 477, 
            h: 408 
        },
        {  
            name: "108 кабинет", 
            desc: "Кабинет для персонала", 
            type: "rect", 
            x: 4980, 
            y: 3426, 
            w: 377, 
            h: 195
        },
        {  
            name: "102а кабинет", 
            desc: "Кабинет психолога", 
            type: "rect", 
            x: 4881, 
            y: 3868, 
            w: 477, 
            h: 637
        },
        {  
            name: "105 кабинет", 
            desc: "Габанова В.Ц.", 
            type: "rect", 
            x: 4881, 
            y: 4504, 
            w: 477, 
            h: 546
        },
        {  
            name: "106 кабинет", 
            desc: "Парамонова Е.Г.", 
            type: "rect", 
            x: 4881, 
            y: 5206, 
            w: 477, 
            h: 491
        },
        { 
            name: "107 кабинет", 
            desc: "Зайганова С.С.", 
            type: "rect", 
            x: 4189, 
            y: 5405, 
            w: 693, 
            h: 519
        },
        {  
            name: "Мужской туалет", 
            desc: "Туалет, 4 кабинки 3 писуара", 
            type: "rect", 
            x: 2038, 
            y: 2014, 
            w: 509, 
            h: 400
        },
        { 
            name: "Женский туалет", 
            desc: "4 кабинки", 
            type: "rect", 
            x: 1745, 
            y: 2562, 
            w: 618, 
            h: 168
        },
        { 
            name: "Столовая", 
            desc: "Столовая, 4 ряда и микроволновка", 
            type: "rect", 
            x: 0, 
            y: 4230, 
            w: 968, 
            h: 803
        },
        { 
            name: "Столовая для преподавателей", 
            desc: "Столовая не для всех", 
            type: "rect", 
            x: 183, 
            y: 3900, 
            w: 366, 
            h: 331
        },
        { 
            name: "Гардероб", 
            desc: "Можно повесить куртку, в теплое время не работает", 
            type: "rect", 
            x: 2032, 
            y: 4232, 
            w: 490, 
            h: 604
        },
        { 
            name: "Стол для пинг-понга", 
            desc: "Можно поиграть, ракетки у охраны", 
            type: "rect", 
            x: 1141, 
            y: 4334, 
            w: 153, 
            h: 301
        },
        { 
            name: "Кофе автомат", 
            desc: "Можно купить кофе, флет уайт 159 рублей", 
            type: "rect", 
            x: 1253, 
            y: 5019, 
            w: 80, 
            h: 95
        },
        { 
            name: "Вендинговый автомат", 
            desc: "Можно подкрепиться на перемене", 
            type: "rect", 
            x: 1357, 
            y: 5034, 
            w: 80, 
            h: 80
        },
        { 
            name: "Кабинет СИС-админа", 
            desc: "В случае потери пропуска, подойти до 8:30", 
            type: "rect", 
            x: 840, 
            y: 1761, 
            w: 517, 
            h: 641
        },
        { 
            name: "Мед-кабинет", 
            desc: "Проводятся вакцинации и другие медицинские мероприятия", 
            type: "rect", 
            x: 1745, 
            y: 1323, 
            w: 669, 
            h: 585
        },
        { 
            name: "Инфо-табло", 
            desc: "Можете ознакомится с сайтом БРИЭТ", 
            type: "rect", 
            x: 1773, 
            y: 3606, 
            w: 130, 
            h: 61
        },
        { 
            name: "Вход/Выход", 
            desc: "Основной вход и выход из здания", 
            type: "rect", 
            x: 1475, 
            y: 5033, 
            w: 433, 
            h: 93
        },
        { 
            name: "Туалет для ОВЗ", 
            desc: "Туалет оборудованный для людей с ОВЗ", 
            type: "rect", 
            x: 4881, 
            y: 3728, 
            w: 141, 
            h: 141
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 2-ой этаж", 
            type: "rect", 
            x: 840, 
            y: 2401, 
            w: 328, 
            h: 226
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 2-ой этаж", 
            type: "rect", 
            x: 2031, 
            y: 3606, 
            w: 636, 
            h: 294
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 2-ой этаж", 
            type: "rect", 
            x: 4190, 
            y: 3427, 
            w: 405, 
            h: 327
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 2-ой этаж", 
            type: "rect", 
            x: 4190, 
            y: 5078, 
            w: 403, 
            h: 327
        },
        { 
            name: "104 кабинет", 
            desc: "Кабинет администрации", 
            type: "rect", 
            x: 4881, 
            y: 5047, 
            w: 477, 
            h: 160
        },
        { 
            name: "Выход", 
            desc: "Дополнительный выход из здания", 
            type: "rect", 
            x: 332, 
            y: 2626, 
            w: 45, 
            h: 154
        },
        { 
            name: "Охрана", 
            desc: "Пункт охраны", 
            type: "rect", 
            x: 1906, 
            y: 5033, 
            w: 126, 
            h: 93
        },
        { 
            name: "Выход", 
            desc: "Аварийный выход из здания", 
            type: "rect", 
            x: 4145, 
            y: 3426, 
            w: 45, 
            h: 154
        },
        { 
            name: "Кабинет Социального Педагога", 
            desc: "Лазарева Т.Н.", 
            type: "rect", 
            x: 5021, 
            y: 3620, 
            w: 337, 
            h: 250
        }
        ],
    "2": [{ 
            name: "Лестница", 
            desc: "Лестница на 3-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 621, 
            w: 224, 
            h: 300
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 3-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 2054, 
            w: 224, 
            h: 300
        },
        { 
            name: "201 Кабинет", 
            desc: "Акатов А.А", 
            type: "rect", 
            x: 0, 
            y: 0, 
            w: 442, 
            h: 622
        },
        { 
            name: "202 Кабинет", 
            desc: "Балбарова Д.Г.", 
            type: "rect", 
            x: 441, 
            y: 0, 
            w: 622, 
            h: 921
        },
        { 
            name: "Туалет для персонала", 
            desc: "", 
            type: "rect", 
            x: 441, 
            y: 919, 
            w: 622, 
            h: 187
        },
        { 
            name: "Учебная часть", 
            desc: "Справки, бегунки и другие вопросы", 
            type: "rect", 
            x: 441, 
            y: 1105, 
            w: 622, 
            h: 444
        },
        { 
            name: "205 Кабинет", 
            desc: "Кабинет администрации", 
            type: "rect", 
            x: 441, 
            y: 1548, 
            w: 622, 
            h: 445
        },
        { 
            name: "206 Кабинет", 
            desc: "Кабинет администрации", 
            type: "rect", 
            x: 441, 
            y: 1992, 
            w: 622, 
            h: 176
        },
        { 
            name: "207 Кабинет", 
            desc: "Бадмацыреновна В.В.", 
            type: "rect", 
            x: 441, 
            y: 2167, 
            w: 622, 
            h: 808
        },
        { 
            name: "208 Кабинет", 
            desc: "Насников А.С.", 
            type: "rect", 
            x: 0, 
            y: 2353, 
            w: 442, 
            h: 622
        }
        ],
    "3": [{ 
            name: "Лестница", 
            desc: "Лестница на 4-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 621, 
            w: 224, 
            h: 300
        },
        { 
            name: "Лестница", 
            desc: "Лестница на 4-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 2054, 
            w: 224, 
            h: 300
        },
        { 
            name: "301 Кабинет", 
            desc: "Усикова А.П.", 
            type: "rect", 
            x: 0, 
            y: 0, 
            w: 442, 
            h: 622
        },
        { 
            name: "302 Кабинет", 
            desc: "Никитина Б.В.", 
            type: "rect", 
            x: 441, 
            y: 0, 
            w: 622, 
            h: 849
        },
        { 
            name: "Туалет", 
            desc: "Туалет общего пользования", 
            type: "rect", 
            x: 441, 
            y: 848, 
            w: 622, 
            h: 237
        },
        { 
            name: "303 Кабинет", 
            desc: "Тураева И.Л.", 
            type: "rect", 
            x: 441, 
            y: 1084, 
            w: 622, 
            h: 480
        },
        { 
            name: "304 Кабинет", 
            desc: "Рыбянцева А.А.", 
            type: "rect", 
            x: 441, 
            y: 1563, 
            w: 622, 
            h: 430
        },
        { 
            name: "305 Кабинет", 
            desc: "Кабинет администрации", 
            type: "rect", 
            x: 441, 
            y: 1992, 
            w: 622, 
            h: 176
        },
        { 
            name: "Библиотека", 
            desc: "Банзаракцаева О.Д.", 
            type: "rect", 
            x: 441, 
            y: 2167, 
            w: 622, 
            h: 808
        },
        { 
            name: "306 Кабинет", 
            desc: "Иванова Н.А.", 
            type: "rect", 
            x: 0, 
            y: 2353, 
            w: 442, 
            h: 622
        }
        ],
    "4": [{ 
            name: "Лестница", 
            desc: "Лестница вниз на 3-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 621, 
            w: 224, 
            h: 300
        },
        { 
            name: "Лестница", 
            desc: "Лестница вниз на 3-ий этаж", 
            type: "rect", 
            x: 0, 
            y: 2054, 
            w: 224, 
            h: 300
        },
        { 
            name: "401 Кабинет", 
            desc: "Буянтуева Л.Б.", 
            type: "rect", 
            x: 0, 
            y: 0, 
            w: 442, 
            h: 622
        },
        { 
            name: "402 Кабинет", 
            desc: "Барлуков Д.Т.", 
            type: "rect", 
            x: 441, 
            y: 0, 
            w: 622, 
            h: 921
        },
        { 
            name: "Туалет", 
            desc: "Туалет общего пользования", 
            type: "rect", 
            x: 441, 
            y: 919, 
            w: 622, 
            h: 149
        },
        { 
            name: "403 Кабинет", 
            desc: "Попова Т.Г.", 
            type: "rect", 
            x: 441, 
            y: 1067, 
            w: 622, 
            h: 482
        },
        { 
            name: "404 Кабинет", 
            desc: "Хабарыгзенова Б.Ц.", 
            type: "rect", 
            x: 441, 
            y: 1548, 
            w: 622, 
            h: 445
        },
        { 
            name: "Подсобка", 
            desc: "Кабинет для хранения вещей", 
            type: "rect", 
            x: 441, 
            y: 1992, 
            w: 622, 
            h: 176
        },
        { 
            name: "405 Кабинет", 
            desc: "Кабинет для совещаний", 
            type: "rect", 
            x: 441, 
            y: 2167, 
            w: 622, 
            h: 808
        },
        { 
            name: "406 Кабинет", 
            desc: "Алексеева А.Г.", 
            type: "rect", 
            x: 0, 
            y: 2353, 
            w: 442, 
            h: 622
        }]
};